[
  {
    "title": "Acceptance of Terms",
    "description": "By accessing or using Shohoje Rokto in any manner, you agree to be bound by these terms and conditions. If you do not agree with any part of these terms, you may not use our services."
  },
  {
    "title": "Eligibility",
    "description": "To use Shohoje Rokto, you must be at least 18 years old and legally capable of entering into binding contracts. By registering on our platform, you confirm that you meet these eligibility criteria."
  },
  {
    "title": "User Account",
    "description": "When you create an account on Shohoje Rokto, you are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account. You agree to notify us immediately of any unauthorized use of your account or any other breach of security."
  },
  {
    "title": "Accuracy of Information",
    "description": "You agree to provide accurate, current, and complete information during the registration process and to keep your information updated. Shohoje Rokto reserves the right to verify the information provided and to suspend or terminate your account if any information is found to be inaccurate or misleading."
  },
  {
    "title": "User Conduct",
    "description": "You agree to use Shohoje Rokto in compliance with all applicable laws and regulations. You will not engage in any activity that is unlawful, offensive, harmful, or infringes upon the rights of others. This includes but is not limited to harassment, spamming, or transmitting any content that contains viruses or malicious code."
  },
  {
    "title": "Privacy Policy",
    "description": "Your privacy is important to us. Please review our Privacy Policy to understand how we collect, use, and protect your personal information."
  },
  {
    "title": "Donation Process",
    "description": "Shohoje Rokto serves as a platform to connect blood donors with recipients in need. By registering as a donor, you agree to provide accurate information about your blood type, availability, and other relevant details. Shohoje Rokto does not guarantee the availability of donors or the success of donation requests."
  },
  {
    "title": "Liability Disclaimer",
    "description": "Shohoje Rokto is provided on an 'as is' and 'as available' basis. We do not make any warranties or representations regarding the accuracy, completeness, or reliability of the platform or its content. We shall not be liable for any direct, indirect, incidental, special, or consequential damages arising out of your use of Shohoje Rokto."
  },
  {
    "title": "Modification of Terms",
    "description": "Shohoje Rokto reserves the right to modify or update these terms and conditions at any time without prior notice. Your continued use of the platform after any such changes constitutes your acceptance of the modified terms."
  },
  {
    "title": "Contact Us",
    "description": "If you have any questions or concerns about these terms and conditions, please contact us."
  }
]
